Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorElementWithDownUpStreamNode Property
 The network needs an input or output element to perform the calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkErrorElementWithDownUpStreamNode { get; }
Public Shared ReadOnly Property NetworkErrorElementWithDownUpStreamNode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkErrorElementWithDownUpStreamNode {
	FailureDefinitionId^ get ();
}
static member NetworkErrorElementWithDownUpStreamNode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace